No auto-route solution was found.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId NoAutoRouteSolutionFoundWarning { get; }
  Visual Basic
Public Shared ReadOnly Property NoAutoRouteSolutionFoundWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NoAutoRouteSolutionFoundWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoRouteFailures Class
  Autodesk.Revit.DB Namespace